package org.venus.shared.dataset.col;

/**
 * DataColumnsクラスは、複数のDataColumnインターフェースを取り扱うためのユーティリティまたは
 * コンテナとして設計されています。このクラスは、データセットの列を体系的に管理し、操作するための
 * 基本的な構造を提供することを目的としています。
 * <p>
 * DataColumnインターフェースの実装を複数管理したり、一括で操作したい場合に利用されることが想定されます。
 */
public class DataColumns {
    /**
     * DataColumnsクラスのコンストラクタです。
     * <p>
     * このクラスはインスタンス化を目的としていないため、コンストラクタはプライベート
     * アクセス修飾子で定義されています。
     * <p>
     * DataColumnsは静的メソッドまたは定数を提供するユーティリティクラスとして設計されています。
     */
    private DataColumns() {
    }
}
